# Dataframe
- 2Ï∞®Ïõê Îç∞Ïù¥ÌÑ∞Ïù¥Îã§. (seriesÎäî 1Ï∞®Ïõê Îç∞Ïù¥ÌÑ∞)
- Îç∞Ïù¥ÌÑ∞ ÌîÑÎ†àÏûÑ Ï†ÑÏ≤¥Ï†ÅÏù∏ ÌååÏïÖ Ìï®Ïàò (Í∞úÏàò, ÎπàÎèÑ):
    - df.shape
    - df.describe()
    - df.info()

In [7]:
import pandas as pd
import numpy as np

direc = '/Users/dasol/Documents/Job/Ìè¨Ïä§ÏΩîÏïÑÏπ¥Îç∞ÎØ∏/Í∞ïÏùòÏûêÎ£å/Part 01~04) Python/04. ·ÑÉ·Ö¶·Ñã·Öµ·Ñê·Ö• ·Ñá·ÖÆ·Ü´·Ñâ·Ö•·Ü®·Ñã·Ö≥·ÜØ ·Ñã·Ö±·Ñí·Ö°·Ü´ Python (Pandas)/data/train.csv'
train_data = pd.read_csv(direc)
train_data.head(n=3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [8]:
train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# DataFrame ÏÉùÏÑ±

In [10]:
# DataFrame ÏÉùÏÑ±
data = {'a': 1, 'b':2}
pd.DataFrame(data, index = [100,200])

     a  b
100  1  2
200  1  2

# CSV Îç∞Ïù¥ÌÑ∞
- comma seperated value
- ÏÑ†ÌÉùÏ†ÅÏúºÎ°ú ÏùΩÏñ¥Ïò§Í∏∞: 
    - pd.read_csv(direc, sep=',', index_col = 'PassengerId', usecols=['PassengerId', 'Survived'])

In [15]:
train_data = pd.read_csv(direc, sep=',', index_col = 'PassengerId', usecols=['PassengerId', 'Survived'])

In [16]:
train_data

             Survived
PassengerId
1                   0
2                   1
3                   1
4                   1
5                   0
...               ...
887                 0
888                 1
889                 0
890                 1
891                 0

[891 rows x 1 columns]

# columnÍ≥º row ÏùΩÍ∏∞
- column Í∞ÄÏ†∏Ïò§Í∏∞: ÎåÄÍ¥ÑÌò∏ ÏÇ¨Ïö©
    - df['column_name']
        - Í∏∞Î≥∏Ï†ÅÏúºÎ°ú columnÏùÑ ÏùΩÏñ¥Ïò®Îã§.
        - ÏóÜÎäî columnÏùÑ ÏùΩÏúºÎ©¥ Ïò§Î•ò Î∞úÏÉù
- column Ïä¨ÎùºÏù¥Ïã±: 
    - df[:10]
    
- row Í∞ÄÏ†∏Ïò§Í∏∞:
    - df.loc[list]
    - df.iloc[list] # 0Î∂ÄÌÑ∞ ÏãúÏûëÎêú Îç∞Ïù¥ÌÑ∞ ÏàúÏÑúÎ°ú Í∞ÄÏ†∏Îäî Î∞©Î≤ï
    - df.loc[[row_list], [column_list]]
    - Boolean selection:
        - ÏòàÏãú)
            - age = df['column']==1
            - class = (df['column']>=1) & (df['column']<10)
            - df[age & class]

In [18]:
train_data['Survived'] # SeriesÎ°ú Î∞òÌôò

PassengerId
1      0
2      1
3      1
4      1
5      0
      ..
887    0
888    1
889    0
890    1
891    0
Name: Survived, Length: 891, dtype: int64

In [20]:
train_data[['Survived']] # dataframeÏúºÎ°ú Î∞òÌôò

             Survived
PassengerId
1                   0
2                   1
3                   1
4                   1
5                   0
...               ...
887                 0
888                 1
889                 0
890                 1
891                 0

[891 rows x 1 columns]

In [24]:
train_data.loc[1]

Survived    0
Name: 1, dtype: int64

In [25]:
train_data.loc[[1, 2]]

             Survived
PassengerId
1                   0
2                   1

# column Ï∂îÍ∞Ä & ÏÇ≠Ï†ú
- Ï∂îÍ∞Ä
    - df['new_column'] = df['column'] *2
    - df.insert(index, 'new_column',['new_column'])
- ÏÇ≠Ï†ú
    - df.drop('column',axis = 0)
        - Î≥µÏÇ¨Î≥∏ Î∞òÌôò
        - inplace ÏòµÏÖò Í∞ÄÎä•

# columnÍ∞Ñ ÏÉÅÍ¥ÄÍ¥ÄÍ≥Ñ
- df.corr()

# NaN Ï≤òÎ¶¨
- ÌôïÏù∏ Î∞©Î≤ï:
    - df.info()ÏóêÏÑú Í∞úÏàòÍ∞Ä Îã§Î•∏ column
    - df.isna()ÏóêÏÑú False
    
- Î¨¥Ïãú
    - df.dropna(): rowÏóê NaNÏù¥ ÌïòÎÇòÎùºÎèÑ ÏûàÎã§Î©¥ ÏÇ≠Ï†ú
        - subset = ['column']): rowÏóê NaNÏù¥ ÏûàÎçîÎùºÎèÑ, subsetÏúºÎ°ú ÏßÄÏ†ïÌïú column Í∞íÏù¥ Ï°¥Ïû¨ÌïòÎ©¥ ÏÇ≠Ï†úÌïòÏßÄ ÏïäÎäîÎã§.
        - axis = 1:  column Ï§ëÏóê ÌïòÎÇòÎùºÎèÑ NaNÏù¥ ÏûàÎã§Î©¥ ÏÇ≠Ï†ú
- Ï±ÑÏö∞Í∏∞
    - ÌèâÍ∑† Í∞íÏúºÎ°ú ÎåÄÏ≤¥ÌïòÍ∏∞
        -df['column'].fillna(df['column'].mean())

# Ïà´ÏûêÌòï Îç∞Ïù¥ÌÑ∞ÏôÄ Î≤îÏ£ºÌòï Îç∞Ïù¥ÌÑ∞(class)
- Î≤îÏ£ºÌòï Îç∞Ïù¥ÌÑ∞
    - classÎ•º ÎÇòÌÉÄÎÉÑ
- Î≤îÏ£ºÌòï Îç∞Ïù¥ÌÑ∞ Î≥ÄÌôò
    - Î≥ÄÌôò Ìï®ÏàòÎ•º ÎßåÎì† ÌõÑ, apply Ìï®ÏàòÎ°ú Ï†ÅÏö©
    
- Ïà´ÏûêÌòï Îç∞Ïù¥ÌÑ∞Î•º Î≤îÏ£ºÌòïÏúºÎ°ú Î≥ÄÌôò
    - df['column'] = df['column'].astype(str)
    
- üìåÎ≤îÏ£ºÌòï Îç∞Ïù¥ÌÑ∞ Ï†ÑÏ≤òÎ¶¨ (Ïà´ÏûêÌòïÏúºÎ°ú Î≥ÄÌôò)
    - one-hot incoding
        - Ìï¥Îãπ Î≤îÏ£ºÏóê Ìï¥ÎãπÌïòÎ©¥ 1, ÏïÑÎãàÎ©¥ 0ÏúºÎ°ú Ï±ÑÏö∞Îäî Ïù∏ÏΩîÎî© Í∏∞Î≤ï
        - pandas.get_dummies: Î≥µÏû°Ìïú valueÎ•º column Î†àÎ≤®Î°ú Ïò¨Î†§ÏÑú 0 ÎòêÎäî 1 Í∞íÏùÑ Í∞ÄÏßÄÍ≤å ÌïúÎã§.
            - drop_first: Î∂àÌïÑÏöîÌïú Î≥ÄÏàòÎ•º Ï§ÑÏó¨Ï§ÄÎã§

In [27]:
# Ïà´ÏûêÌòï Îç∞Ïù¥ÌÑ∞Î•º Î≤îÏ£ºÌòïÏúºÎ°ú Î≥ÄÌôò
import math

def age_categorize(age):
    if math.isnan(age):
        return -1
    return math.floor(age/10)*10  

df = pd.read_csv(direc)
df['Age'].apply(age_categorize)

In [30]:
# Î≤îÏ£ºÌòï Îç∞Ïù¥ÌÑ∞ Ï†ÑÏ≤òÎ¶¨
# one-hot incoding
pd.get_dummies(df)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,"Name_Abbing, Mr. Anthony","Name_Abbott, Mr. Rossmore Edward","Name_Abbott, Mrs. Stanton (Rosa Hunt)",...,Cabin_F G73,Cabin_F2,Cabin_F33,Cabin_F38,Cabin_F4,Cabin_G6,Cabin_T,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,2,1,1,38.0,1,0,71.2833,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,0,0,0,...,0,0,0,0,0,0,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,0,0,0,...,0,0,0,0,0,0,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,0,0,...,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,27.0,0,0,13.0000,0,0,0,...,0,0,0,0,0,0,0,0,0,1
887,888,1,1,19.0,0,0,30.0000,0,0,0,...,0,0,0,0,0,0,0,0,0,1
888,889,0,3,NaN,1,2,23.4500,0,0,0,...,0,0,0,0,0,0,0,0,0,1
889,890,1,1,26.0,0,0,30.0000,0,0,0,...,0,0,0,0,0,0,0,1,0,0
890,891,0,3,32.0,0,0,7.7500,0,0,0,...,0,0,0,0,0,0,0,0,1,0

In [31]:
# PclassÍ∞Ä Ïù¥Ï†ÑÏóêÎäî 1,2,3 Ï§ëÏùò ÌïòÎÇòÏùò Í∞íÏùÑ Í∞ÄÏ°åÎã§.
# get_dummiesÏóêÏÑú columnsÎ•º ÏßÄÏ†ï=> 1,2,3 Í∞Å Í∞íÏùÑ columnÏúºÎ°ú Î≥ÄÌôòÌïòÏó¨ 0 ÎòêÎäî 1Î°ú Ï±ÑÏõåÏ§ÄÎã§.
pd.get_dummies(df, columns = ['Pclass', 'Sex'])

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_1,Pclass_2,Pclass_3,Sex_female,Sex_male
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,1,0,0,1,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1,1,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,1,0,0,1,0
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,0,0,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,S,0,1,0,0,1
887,888,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,S,1,0,0,1,0
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,S,0,0,1,1,0
889,890,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,C,1,0,0,0,1
890,891,0,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,Q,0,0,1,0,1

In [32]:
# drop_first=True
# Î∂àÌïÑÏöîÌïú Î≥ÄÏàòÎ•º Ï§ÑÏó¨Ï§ÄÎã§.
# 1,2,3 Ï§ëÏóê 2ÏôÄ 3Ïù¥ 0Ïù∏ Í≤ΩÏö∞ 1Ïóê Ìï¥ÎãπÌïòÎØÄÎ°ú Î≥ÄÏàòÎ•º Ï§ÑÏó¨Ï§ÄÎã§.
pd.get_dummies(df, columns = ['Pclass', 'Sex'], drop_first=True)

,PassengerId,Survived,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Pclass_2,Pclass_3,Sex_male
0,1,0,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,0,1,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,0,0,0
2,3,1,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,0,0,0
4,5,0,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",27.0,0,0,211536,13.0000,NaN,S,1,0,1
887,888,1,"Graham, Miss. Margaret Edith",19.0,0,0,112053,30.0000,B42,S,0,0,0
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,2,W./C. 6607,23.4500,NaN,S,0,1,0
889,890,1,"Behr, Mr. Karl Howell",26.0,0,0,111369,30.0000,C148,C,0,0,1
890,891,0,"Dooley, Mr. Patrick",32.0,0,0,370376,7.7500,NaN,Q,0,1,1